Revit 2026 API

# DisplayUnit Enumeration

---

Describes the type of Revit display unit, metric or imperial.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DisplayUnit
```
```vb
Public Enumeration DisplayUnit
```
```cpp
public enum class DisplayUnit
```
```fsharp
type DisplayUnit
```

| Member name | Value | Description |
| --- | --- | --- |
| IMPERIAL | 1 |  |
| METRIC | 0 |  |

#### Reference

Autodesk.Revit.DB Namespace